In [1]:
import pandas as pd
import numpy as np

In [3]:
data = pd.DataFrame({"a":["one", "two"] * 3,
                     "b":[1,1,2,3,2,3]})
data

     a  b
0  one  1
1  two  1
2  one  2
3  two  3
4  one  2
5  two  3

In [6]:
data.duplicated()

0    False
1    False
2    False
3    False
4     True
5     True
dtype: bool

In [7]:
data.drop_duplicates()

     a  b
0  one  1
1  two  1
2  one  2
3  two  3

In [8]:
data["c"] = range(6)
data

     a  b  c
0  one  1  0
1  two  1  1
2  one  2  2
3  two  3  3
4  one  2  4
5  two  3  5

In [15]:
data.duplicated(["a","b"], keep="last")

0    False
1    False
2     True
3     True
4    False
5    False
dtype: bool

In [16]:
df = pd.DataFrame({"names":["Tim", "tom", "Sam", "kate", "Kim"],
                   "scores":[60,50,70,80,40]})
df

  names  scores
0   Tim      60
1   tom      50
2   Sam      70
3  kate      80
4   Kim      40

In [17]:
classes = {"Tim":"A", "Tom":"A", "Sam":"B", "Kate":"B", "Kim":"B"}

In [19]:
n = df["names"].str.capitalize()

In [20]:
df["classes"] = n.map(classes)

In [21]:
df

  names  scores classes
0   Tim      60       A
1   tom      50       A
2   Sam      70       B
3  kate      80       B
4   Kim      40       B

In [22]:
# replacing
s = pd.Series([80, 70, 90, 60])
s

0    80
1    70
2    90
3    60
dtype: int64

In [23]:
s.replace([80,70], [np.nan, 0])

0     NaN
1     0.0
2    90.0
3    60.0
dtype: float64

In [24]:
s

0    80
1    70
2    90
3    60
dtype: int64

In [26]:
df = pd.DataFrame(
    np.arange(12).reshape(3,4),
    index=[0,1,2],
    columns=['tim','tom','kim','sam']
)
df

   tim  tom  kim  sam
0    0    1    2    3
1    4    5    6    7
2    8    9   10   11

In [29]:
s = pd.Series(["one","two","three"])
df.index=df.index.map(s)
df.rename(index=str.title, columns=str.upper)

       TIM  TOM  KIM  SAM
One      0    1    2    3
Two      4    5    6    7
Three    8    9   10   11